{
  "nodes": [
    {
      "op": "null", 
      "name": "q_data", 
      "attrs": {"__shape__": "(200, 32)"}, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "q_embed_weight", 
      "attrs": {
        "input_dim": "111", 
        "output_dim": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "q_embed", 
      "attrs": {
        "input_dim": "111", 
        "output_dim": "50"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "qa_data", 
      "attrs": {"__shape__": "(200, 32)"}, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "qa_embed_weight", 
      "attrs": {
        "input_dim": "221", 
        "output_dim": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "qa_embed", 
      "attrs": {
        "input_dim": "221", 
        "output_dim": "100"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[3, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RNNl0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(200, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "RNNreshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RNNl0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(200, 50)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "RNNreshape1", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RNNl0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(200,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "RNNreshape2", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "RNNl0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(200,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "RNNreshape3", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "RNN_rnn_param_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[10, 0, 0], [12, 0, 0], [14, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "RNNh0_0", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(1, 0, 50)"
      }, 
      "inputs": []
    }, 
    {
      "op": "_zeros", 
      "name": "RNNh0_1", 
      "attrs": {
        "__layout__": "LNC", 
        "dtype": "float32", 
        "shape": "(1, 0, 50)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "RNNrnn0", 
      "attrs": {
        "bidirectional": "False", 
        "lstm_state_clip_max": "None", 
        "lstm_state_clip_min": "None", 
        "lstm_state_clip_nan": "False", 
        "mode": "lstm", 
        "num_layers": "1", 
        "p": "0", 
        "projection_size": "None", 
        "state_outputs": "True", 
        "state_size": "50", 
        "use_sequence_length": "False"
      }, 
      "inputs": [[8, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(-3, 0)"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pred_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "pred_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "pred", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "target", 
      "attrs": {"__shape__": "(200, 32)"}, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "final_pred", 
      "attrs": {
        "ignore_label": "-1.0", 
        "op_type": "LogisticRegressionMaskOutput"
      }, 
      "inputs": [[25, 0, 0], [27, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    4, 
    6, 
    9, 
    11, 
    13, 
    15, 
    22, 
    23, 
    26
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31
  ], 
  "heads": [[28, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}